* Initiating Option Position
** Call
- 30% @ The Money Premium (first approximation)
- Find a strike at that value
** Put
- 30% @ The Money Premium (first approximation)
- STO Put
- BTO Put * .5 of ^

137 3.35

HD Feb 17
| Op  | Type | Quantity | Strike | Worst | Best |
|-----+------+----------+--------+-------+------|
| STO | Call |        1 |    143 |   103 |  109 |
| STO | Put  |        1 |    129 |    96 |  104 |
| BTO | Put  |        1 |    124 |   -53 |  -45 |
|-----+------+----------+--------+-------+------|
|     |      |          |        |   146 |  168 |
#+TBLFM: @5$5=vsum(@2..@-1)::@5$6=vsum(@2..@-1)

HD Feb 17
@The Money Call Premium 415
@The Money Put Premium 443

Call .3 of 415 = 125
Put .3 of 443 = 133

| Op  | Type | Quantity | Strike | Worst | Best |
|-----+------+----------+--------+-------+------|
| STO | Call |        1 |    145 |   121 |  123 |
| STO | Put  |        1 |    125 |    97 |   99 |
| BTO | Put  |        1 |    115 |   -35 |  -34 |
|-----+------+----------+--------+-------+------|
|     |      |          |        |   183 |  188 |
#+TBLFM: @5$5=vsum(@2..@4)::@5$6=vsum(@2..@4)

Call .3 of 250 = 75
Put .3 of 195 = 58

ICE Mar 17
@The Money Call Premium 250
@The Money Put Premium 195

| Op  | Type | Quantity | Strike | Worst | Best |
|-----+------+----------+--------+-------+------|
| STO | Call |        3 |     62 |    40 |   50 |
| BTO | Put  |        1 |     48 |   -40 |  -30 |
|-----+------+----------+--------+-------+------|
|     |      |          |        |    80 |  120 |


STO Jul 17
| Op  | Type | Quantity | Strike | Worst | Best |
|-----+------+----------+--------+-------+------|
| STO | Call |        1 |     20 |    75 |   85 |
| STO | Put  |        2 |   17.5 |   200 |  270 |
|     |      |          |        |   275 |  355 |
|     |      |          |        |       |      |


NAT Jul 17
| Op  | Type | Quantity | Strike | Worst | Best |
|-----+------+----------+--------+-------+------|
| STO | Call |        2 |     10 |    60 |  100 |
| STO | Put  |        3 |      7 |   120 |  180 |
|     |      |          |        |   180 |  280 |

SELL -1 2/3 CUSTOM NAT 100 21 JUL 17/21 JUL 17 10/7 CALL/PUT @2.30 LMT [TO OPEN/TO OPEN]

| Side + Pos | Exp    | Type | Qty | Strike | Bid | Ask | Worst | Best |
|------------+--------+-------+-----+--------+-----+-----+-------+------|
| STO        | Jul 17 | Call  |  -2 |        |     |     |       |      |


SELL BP
| Side + Pos | Exp    | Type | Qty | Strike | Bid | Ask | Worst | Best |
|------------+--------+------+-----+--------+-----+-----+-------+------|
| STO        | Mar 17 | Put  |  10 |     33 |  23 |  24 |   230 |  240 |
| BTO        | Mar 17 | Put  | -10 |     28 |   3 |   4 |   -40 |  -30 |
|            |        |      |     |        |     |     |   190 |  210 |
